fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьОшибка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресВХранилище = Параметры.АдресВХранилище;

    Если Не ЗначениеЗаполнено(АдресВХранилище) Тогда
        Возврат;
    КонецЕсли;

    Попытка
        ТЗИсточник = ПолучитьИзВременногоХранилища(АдресВХранилище);
    Исключение
        ТекстСообщения = СтрШаблон("Ошибка получения данных из временного хранилища: %1",ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
        Возврат;
    КонецПопытки;

    Если ТипЗнч(ТЗИсточник) <> Тип("ТаблицаЗначений") Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные из временного хранилища не являются таблицей значений.");
        Возврат;
    КонецЕсли;

    // Проверяем наличие обязательных колонок в исходной ТЗ
    Если ТЗИсточник.Колонки.Найти("Сотрудник") = Неопределено
        ИЛИ ТЗИсточник.Колонки.Найти("ДатаНачала") = Неопределено
        ИЛИ ТЗИсточник.Колонки.Найти("ДатаОкончания") = Неопределено Тогда
        
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В таблице значений отсутствуют обязательные колонки: Сотрудник, ДатаНачала, ДатаОкончания.");
        Возврат;
    КонецЕсли;
	
	ГрафикОтпусков.Очистить();
    
    Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
	
	Для Каждого Строка Из ТЗИсточник Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;

      
КонецПроцедуры
